package ru.job4j.ood.ocp;

public class Property {
    /*
    public void toPayProperty(String name, MemProperty type) {
        if (type == MemProperty.APARTAMENTS) {
        writeAgree(name);
        } else if (type == MemProperty.HOUSE) {
        writeAgree(name);
        }
    }

    Необходимо реализовать требование покупки жилья. Так же есть нарушение OCP. Так как если, нам будет
    необходимо добавить новый функционал, типа: страна или тип дома, то нужно будет менять в главном классе.
    А без нарушения, мы просто имплементим нашу абстракцию(класс с методом) и реализуем новую стратегию
    ак же Здесь мы не можем применить наследование, так как не каждая недвижимость, это жилье. Это и может быть
    подземная парковка для машины.
     */
}
